Identifier: com.github.jschimmer-ic.jamf.R-arm64
ParentRecipe: com.github.jschlimmer-ic.pkg.R-arm64
MinimumVersion: '2.3'

Input:
  NAME: R-arm64
  SOFTWARE_TITLE: '%NAME%'
  CATEGORY: Productivity
  GROUP_NAME: '%NAME%-update-smart'
  GROUP_TEMPLATE: 'JamfSmartGroupTemplate.xml'
  POLICY_CATEGORY: Testing
  POLICY_TEMPLATE: 'JamfPolicyTemplate.xml'
  POLICY_NAME: 'Install Latest %NAME%'
  SELF_SERVICE_DISPLAY_NAME: 'Install Latest %NAME%'
  SELF_SERVICE_DESCRIPTION: 'R is a free software environment for statistical computing and graphics.'
  SELF_SERVICE_ICON: '%SOFTWARE_TITLE%.png'
  INSTALL_BUTTON_TEXT: 'Install'
  REINSTALL_BUTTON_TEXT: 'Install'
  TESTING_GROUP_NAME: Testing
  UPDATE_PREDICATE: 'pkg_uploaded == False'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: '%CATEGORY%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: '%CATEGORY%'

  - Processor: StopProcessingIf
    Arguments:
      predicate: '%UPDATE_PREDICATE%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: '%GROUP_TEMPLATE%'
      computergroup_name: '%GROUP_NAME%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: '%POLICY_TEMPLATE%'
      policy_name: '%POLICY_NAME%'
      icon: '%SELF_SERVICE_ICON%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfExtensionAttributeUploader
    Arguments:
      ea_name: '%NAME%-version'
      ea_script_path: 'r-arm64-ea.sh'
