<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of R for Apple Silicon. (Also known as "The R Project for Statistical Computing.")</string>
	<key>Identifier</key>
	<string>com.github.jschlimmer-ic.download.R-arm64</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>R</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>&lt;a href="base\/(?P&lt;filename&gt;R-(?P&lt;version&gt;[\d.]+)-arm64\.pkg)"&gt;R-[\d.]+-arm64\.pkg&lt;/a&gt;</string>
				<key>url</key>
				<string>https://cran.r-project.org/bin/macosx/big-sur-arm64/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://cran.r-project.org/bin/macosx/big-sur-arm64/%filename%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Simon Urbanek (VZLD955F6P)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
