<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uses parent download recipe to get Nudge package</string>
	<key>Identifier</key>
	<string>com.github.jschlimmer-ic.pkg.Nudge</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Nudge</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.erikng.download.Nudge</string>
	<key>Process</key>
	<array/>
</dict>
</plist>
